---
kind: type
id: T:Autodesk.Revit.DB.Lighting.ColorPreset
source: html/4637cb36-a5ab-ce69-4a8c-8f0d8a45f5fc.htm
---
# Autodesk.Revit.DB.Lighting.ColorPreset

Preset values of initial colors for specific lighting types

## Syntax (C#)
```csharp
public enum ColorPreset
```